package com.it.main;
/*
 *     새로운 기능 추가 (오버로딩)
 *     기존의 기능 변경 (오버라이딩)
 *     -------------- 다형성 
 *     
 *     -----------------------------------------
 *        오버로딩                       오버라이딩(덮어쓴다) 
 *     -----------------------------------------
 *       같은 클래스내에서           상속을 받은 경우 
 *     -----------------------------------------
 *       메소드명이 동일             메소드명이 동일 
 *     -----------------------------------------
 *       매개변수의 갯수나         매개변수 동일 
 *       데이터형이 다르다 
 *       => 생성자
 *     -----------------------------------------
 *       리턴형을 관계없다        리턴형이 동일 
 *     -----------------------------------------
 *                        접근지정어를 확대는 가능 , 축소는 불가능 
 *     -----------------------------------------
 */
public class UserMain {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        
	}

}
